_posts/2014-01-29-Using-tags-to-filter-lists-in-Python.html
---
title: Using tags to filter lists in Python
date: 2014/01/29 12:52:51
updated: 2014/01/29 12:52:53
categories: python
tags: 
---


<p>
Suppose you have a collection of items in a list, and you want to filter the list based on some properties of the items, and then accumulate some other property on the filtered items. We will look at some strategies for this here.
</p>

<p>
The particular application is that I have a list of courses that make up a curriculum, and I want to summarize the curriculum in a variety of ways. For example, I might want to know how many Gen Ed courses there are, or how many math, chemistry, biology and physics courses there are. I may want to know how may units overall are required. 
</p>

<p>
A course will be represented by a class, which simply holds the data about the course. Here we consider the course number (which is really a string), the number of units of the course, and what category the course fits into. There will be 7 categories here: chemistry, biology, physics, math, engineering, general education, and free elective.
</p>

<p>
We will use some binary math to represent the categories. Essentially we define tags as if they are binary numbers, and then we can use binary operators to tell if an item is tagged a particular way. We use &amp; to do a logical AND between a variable and a TAG. If it comes out True, the variable has that tag.
</p>

<p>
This works basically by defining a TAG like a binary number, e.g. TAG1 = 100,
TAG2 = 010, TAG3 = 001. Then, if you have a number like 110, you know it is tagged with TAG1 and TAG2, but not TAG3. We can figure that out with code too. 
</p>
<pre class="example">
100 &amp; 110 = 100 = 1
010 &amp; 110 = 010 = 2
</pre>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #8b0000;">print</span> 1 &amp; 3
<span style="color: #8b0000;">print</span> 2 &amp; 3
</pre>
</div>

<pre class="example">
1
2
</pre>

<p>
Let us try out an example. The easiest way to define the tags, is as powers of two.
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">define some tags</span>
<span style="color: #8b008b;">TAG1</span> = 2**0  <span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">100</span>
<span style="color: #8b008b;">TAG2</span> = 2**1  <span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">010</span>

<span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">Now define a variable that is "tagged"</span>
<span style="color: #8b008b;">a</span> = TAG1
<span style="color: #8b0000;">print</span> a &amp; TAG1 <span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">remember that 0 = False, everything else is true</span>
<span style="color: #8b0000;">print</span> a &amp; TAG2
</pre>
</div>

<pre class="example">
1
0
</pre>

<p>
We can use multiple tags by adding them together.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">define some tags</span>
<span style="color: #8b008b;">TAG1</span> = 2**0  <span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">100</span>
<span style="color: #8b008b;">TAG2</span> = 2**1  <span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">010</span>
<span style="color: #8b008b;">TAG3</span> = 2**2  <span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">001</span>

<span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">Now define a variable that is "tagged"</span>
<span style="color: #8b008b;">a</span> = TAG1 + TAG2  <span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">1 + 2 = 3 = 110 in binary</span>
<span style="color: #8b0000;">print</span> a &amp; TAG1 
<span style="color: #8b0000;">print</span> a &amp; TAG2
<span style="color: #8b0000;">print</span> a &amp; TAG3
</pre>
</div>

<pre class="example">
1
2
0
</pre>

<p>
You can see that the variable is not tagged by TAG3, but is tagged with TAG1 and TAG2. We might want to tag an item with more than one tag.  We create groups of tags by simply adding them together. We can still check if a variable has a particular tag like we did before.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">define some tags</span>
<span style="color: #8b008b;">TAG1</span> = 2**0  <span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">100</span>
<span style="color: #8b008b;">TAG2</span> = 2**1  <span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">010</span>
<span style="color: #8b008b;">TAG3</span> = 2**2  <span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">001</span>

<span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">Now define a variable that is "tagged"</span>
<span style="color: #8b008b;">a</span> = TAG1 + TAG2  <span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">1 + 2 = 3 = 110 in binary</span>
<span style="color: #8b0000;">print</span> a &amp; TAG1
<span style="color: #8b0000;">print</span> a &amp; TAG2
<span style="color: #8b0000;">print</span> a &amp; TAG3
</pre>
</div>

<pre class="example">
1
2
0
</pre>

<p>
It is trickier to say if a variable is tagged with a particular set of tags. Let us consider why. The binary representation of TAG1 + TAG2 is 110. The binary representation of TAG2 + TAG3 is 011. If we simply consider (TAG1 + TAG2) &amp; (TAG2 &amp; TAG3) we get 010. That actually tells us that we do not have a match, because 010 is not equal to (TAG2 &amp; TAG3 = 011). In other words, the logical AND of the tag with some sum of tags is equal to the sum of tags when there is a match. So, we can check if that is the case with an equality comparison.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">define some tags</span>
<span style="color: #8b008b;">TAG1</span> = 2**0  <span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">100</span>
<span style="color: #8b008b;">TAG2</span> = 2**1  <span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">010</span>
<span style="color: #8b008b;">TAG3</span> = 2**2  <span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">001</span>

<span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">Now define a variable that is "tagged"</span>
<span style="color: #8b008b;">a</span> = TAG1 + TAG2  <span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">1 + 2 = 3 = 110 in binary</span>
<span style="color: #8b0000;">print</span> (a &amp; (TAG1 + TAG2)) == TAG1 + TAG2
<span style="color: #8b0000;">print</span> (a &amp; (TAG1 + TAG3)) == TAG1 + TAG3
<span style="color: #8b0000;">print</span> (a &amp; (TAG2 + TAG3)) == TAG2 + TAG3
</pre>
</div>

<pre class="example">
True
False
False
</pre>

<p>
Ok, enough binary math, let us see an application. Below we create a set of tags indicating the category a course falls into, a class definition to store course data in attributes of an object, and a list of courses. Then, we show some examples of list comprehension filtering based on the tags to summarize properties of the list. The logical comparisons are simple below, as the courses are not multiply tagged at this point.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #8b008b;">CHEMISTRY</span> = 2**0
<span style="color: #8b008b;">BIOLOGY</span> = 2**1
<span style="color: #8b008b;">PHYSICS</span> = 2**2
<span style="color: #8b008b;">MATH</span> = 2**3
<span style="color: #8b008b;">ENGINEERING</span> = 2**4
<span style="color: #8b008b;">GENED</span> = 2**5
<span style="color: #8b008b;">FREE</span> = 2**6

<span style="color: #8b0000;">class</span> <span style="color: #4682b4;">Course</span>:
    <span style="color: #228b22;">'''simple container for course information'''</span>
    <span style="color: #8b0000;">def</span> <span style="color: #8b2323;">__init__</span>(<span style="color: #8b0000;">self</span>, number, units, category):
        <span style="color: #8b0000;">self</span>.number = number
        <span style="color: #8b0000;">self</span>.units = units
        <span style="color: #8b0000;">self</span>.category = category
    <span style="color: #8b0000;">def</span> <span style="color: #8b2323;">__repr__</span>(<span style="color: #8b0000;">self</span>):
        <span style="color: #8b0000;">return</span> <span style="color: #8b0000;">self</span>.number


<span style="color: #8b008b;">courses</span> = [Course(<span style="color: #228b22;">'09-105'</span>, 9, CHEMISTRY),
           Course(<span style="color: #228b22;">'09-106'</span>, 9, CHEMISTRY),
           Course(<span style="color: #228b22;">'33-105'</span>, 12, PHYSICS),
           Course(<span style="color: #228b22;">'33-106'</span>, 12, PHYSICS),
           Course(<span style="color: #228b22;">'21-120'</span>, 10, MATH),
           Course(<span style="color: #228b22;">'21-122'</span>, 10, MATH),
           Course(<span style="color: #228b22;">'21-259'</span>, 10, MATH),
           Course(<span style="color: #228b22;">'06-100'</span>, 12, ENGINEERING),
           Course(<span style="color: #228b22;">'xx-xxx'</span>, 9, GENED),     
           Course(<span style="color: #228b22;">'xx-xxx'</span>, 9, FREE), 
           Course(<span style="color: #228b22;">'03-232'</span>, 9, BIOLOGY)]

<span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">print the total units</span>
<span style="color: #8b0000;">print</span> <span style="color: #228b22;">' Total units = {0}'</span>.<span style="color: #cd0000;">format</span>(<span style="color: #cd0000;">sum</span>([x.units <span style="color: #8b0000;">for</span> x <span style="color: #8b0000;">in</span> courses]))

<span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">get units of math required</span>
<span style="color: #8b008b;">math_units</span> = <span style="color: #cd0000;">sum</span>([x.units  <span style="color: #8b0000;">for</span> x <span style="color: #8b0000;">in</span> courses <span style="color: #8b0000;">if</span> x.category &amp; MATH])

<span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">get total units of math, chemistry, physics and biology a | b is a</span>
<span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">logical OR. This gives a prescription for tagged with MATH OR</span>
<span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">CHEMISTRY OR PHYSICS OR BIOLOGY</span>
<span style="color: #8b008b;">BASIC_MS</span> = MATH | CHEMISTRY | PHYSICS | BIOLOGY

<span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">total units in those categories</span>
<span style="color: #8b008b;">basic_math_science</span> = <span style="color: #cd0000;">sum</span>([x.units <span style="color: #8b0000;">for</span> x <span style="color: #8b0000;">in</span> courses <span style="color: #8b0000;">if</span> x.category &amp; BASIC_MS])

<span style="color: #8b0000;">print</span> <span style="color: #228b22;">'We require {0} units of math out of {1} units of basic math and science courses.'</span>.<span style="color: #cd0000;">format</span>(math_units, basic_math_science)

<span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">We are required to have at least 96 units of Math and Sciences.</span>
<span style="color: #8b0000;">print</span> <span style="color: #228b22;">'We are compliant on number of Math and science: '</span>,basic_math_science &gt;= 96
</pre>
</div>

<pre class="example">
 Total units = 111
We require 30 units of math out of 81 units of basic math and science courses.
We are compliant on number of Math and science:  False
</pre>

<p>
That is all for this example. With more data for each course, you could see what courses are taken in what semesters, how many units are in each semester, maybe create a prerequisite map, and view the curriculum by categories of courses, etc&#x2026;</p>
<p>Copyright (C) 2014 by John Kitchin. See the <a href="/copying.html">License</a> for information about copying.<p><p><a href="/org/2014/01/29/Using-tags-to-filter-lists-in-Python.org">org-mode source</a><p><p>Org-mode version = 8.2.5g</p>